<a href="https://colab.research.google.com/github/JuniorGunner/DataScienceFormation/blob/master/Pandas/Pandas_Class06.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Class 06
## Relatório de Análise V
### Tratamento de Dados Faltantes

In [19]:
import pandas as pd

dados = pd.read_csv('aluguel_residencial.csv', sep = ';')
dados.head(10)

                 Tipo           Bairro  Quartos  ...    Valor  Condominio  IPTU
0           Quitinete       Copacabana        1  ...   1700.0       500.0  60.0
1                Casa  Jardim Botânico        2  ...   7000.0         NaN   NaN
2         Apartamento           Centro        1  ...    800.0       390.0  20.0
3         Apartamento     Higienópolis        1  ...    800.0       230.0   NaN
4         Apartamento     Vista Alegre        3  ...   1200.0         NaN   NaN
5         Apartamento         Cachambi        2  ...   1300.0       301.0  17.0
6  Casa de Condomínio  Barra da Tijuca        5  ...  22000.0         NaN   NaN
7  Casa de Condomínio            Ramos        2  ...   1000.0         NaN   NaN
8         Apartamento           Centro        1  ...   1200.0         NaN   NaN
9         Apartamento           Grajaú        2  ...   1500.0       642.0  74.0

[10 rows x 9 columns]

In [20]:
dados.isnull().head(10)
# dados.notnull()

    Tipo  Bairro  Quartos  Vagas  Suites   Area  Valor  Condominio   IPTU
0  False   False    False  False   False  False  False       False  False
1  False   False    False  False   False  False  False        True   True
2  False   False    False  False   False  False  False       False  False
3  False   False    False  False   False  False  False       False   True
4  False   False    False  False   False  False  False        True   True
5  False   False    False  False   False  False  False       False  False
6  False   False    False  False   False  False  False        True   True
7  False   False    False  False   False  False  False        True   True
8  False   False    False  False   False  False  False        True   True
9  False   False    False  False   False  False  False       False  False

In [21]:
""" Dataframe information """
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22580 entries, 0 to 22579
Data columns (total 9 columns):
Tipo          22580 non-null object
Bairro        22580 non-null object
Quartos       22580 non-null int64
Vagas         22580 non-null int64
Suites        22580 non-null int64
Area          22580 non-null int64
Valor         22571 non-null float64
Condominio    20765 non-null float64
IPTU          15795 non-null float64
dtypes: float64(3), int64(4), object(2)
memory usage: 1.6+ MB

In [22]:
""" Registers where 'Valor' is null """
dados[dados['Valor'].isnull()]

             Tipo           Bairro  Quartos  ...  Valor  Condominio   IPTU
58    Apartamento  Barra da Tijuca        2  ...    NaN       970.0   68.0
1492  Apartamento             Leme        2  ...    NaN       878.0    NaN
1683         Casa     Campo Grande        3  ...    NaN         NaN    NaN
2012  Apartamento         Botafogo        2  ...    NaN      1010.0  170.0
2034  Apartamento       Copacabana        2  ...    NaN       850.0    NaN
4941         Casa     Campo Grande        3  ...    NaN         NaN    NaN
8568  Apartamento             Leme        2  ...    NaN       878.0    NaN
8947  Apartamento           Glória        3  ...    NaN       910.0  228.0
9149  Apartamento            Gávea        3  ...    NaN       880.0  221.0

[9 rows x 9 columns]

In [23]:
""" Removing nulls 'dropna' """
A = dados.shape[0]
dados.dropna(subset = ['Valor'], inplace = True)
B = dados.shape[0]
A - B

9

In [24]:
dados[dados['Valor'].isnull()]

Empty DataFrame
Columns: [Tipo, Bairro, Quartos, Vagas, Suites, Area, Valor, Condominio, IPTU]
Index: []

In [25]:
dados[dados['Condominio'].isnull()].shape[0]

1813

In [26]:
selecao = (dados['Tipo'] == 'Apartamento') & (dados['Condominio'].isnull())
A = dados.shape[0]
dados = dados[~selecao] # ~ inverte a Series booleana pois representa os valores a serem retirados inicialmente
B = dados.shape[0]
A - B

745

In [29]:
dados[dados['Condominio'].isnull()].shape[0]

1068

In [30]:
selecao = (dados['Tipo'] == 'Apartamento') & (dados['Condominio'].isnull())
dados[selecao].shape[0]

0

In [31]:
dados.head(10)

                  Tipo               Bairro  Quartos  ...    Valor  Condominio  IPTU
0            Quitinete           Copacabana        1  ...   1700.0       500.0  60.0
1                 Casa      Jardim Botânico        2  ...   7000.0         NaN   NaN
2          Apartamento               Centro        1  ...    800.0       390.0  20.0
3          Apartamento         Higienópolis        1  ...    800.0       230.0   NaN
5          Apartamento             Cachambi        2  ...   1300.0       301.0  17.0
6   Casa de Condomínio      Barra da Tijuca        5  ...  22000.0         NaN   NaN
7   Casa de Condomínio                Ramos        2  ...   1000.0         NaN   NaN
9          Apartamento               Grajaú        2  ...   1500.0       642.0  74.0
10         Apartamento  Lins de Vasconcelos        3  ...   1500.0       455.0  14.0
11         Apartamento           Copacabana        1  ...   2000.0       561.0  50.0

[10 rows x 9 columns]

In [33]:
dados.fillna(0, inplace = True)
# dados = dados.fillna({'Condominio': 0, 'IPTU': 0})
dados.head(10)

                  Tipo               Bairro  Quartos  ...    Valor  Condominio  IPTU
0            Quitinete           Copacabana        1  ...   1700.0       500.0  60.0
1                 Casa      Jardim Botânico        2  ...   7000.0         0.0   0.0
2          Apartamento               Centro        1  ...    800.0       390.0  20.0
3          Apartamento         Higienópolis        1  ...    800.0       230.0   0.0
5          Apartamento             Cachambi        2  ...   1300.0       301.0  17.0
6   Casa de Condomínio      Barra da Tijuca        5  ...  22000.0         0.0   0.0
7   Casa de Condomínio                Ramos        2  ...   1000.0         0.0   0.0
9          Apartamento               Grajaú        2  ...   1500.0       642.0  74.0
10         Apartamento  Lins de Vasconcelos        3  ...   1500.0       455.0  14.0
11         Apartamento           Copacabana        1  ...   2000.0       561.0  50.0

[10 rows x 9 columns]

In [34]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 21826 entries, 0 to 22579
Data columns (total 9 columns):
Tipo          21826 non-null object
Bairro        21826 non-null object
Quartos       21826 non-null int64
Vagas         21826 non-null int64
Suites        21826 non-null int64
Area          21826 non-null int64
Valor         21826 non-null float64
Condominio    21826 non-null float64
IPTU          21826 non-null float64
dtypes: float64(3), int64(4), object(2)
memory usage: 1.7+ MB

* New .csv with non-null fields

In [0]:
dados.to_csv('aluguel_residencial.csv', sep = ';', index = False)

## Extras - Métodos de Interpolação

In [39]:
data = [0.5, None, None, 0.52, 0.54, None, None, 0.59, 0.6, None, 0.7]
s = pd.Series(data)
s

0     0.50
1      NaN
2      NaN
3     0.52
4     0.54
5      NaN
6      NaN
7     0.59
8     0.60
9      NaN
10    0.70
dtype: float64

In [40]:
s.fillna(0)
# s.fillna(method = 'ffill') # preenche o campo nulo com o valor da linha anterior | utilizado com campo tipo tempo por exemplo
# s.fillna(method = 'bfill') # preenche o campo nulo com o valor da linha abaixo
# s.fillna(s.mean()) # preenche o campo nulo com a média dos valores não-nulos
# Parâmetro 'limit' restringe qtd de linhas na busca de valor para preenchimento

0     0.50
1     0.00
2     0.00
3     0.52
4     0.54
5     0.00
6     0.00
7     0.59
8     0.60
9     0.00
10    0.70
dtype: float64